# в пайтон динамическая типизация -> тип данных переменных определять не нужно

name = "abc" # string
ch = 'c'

a = 23      # integer
b = 1.233   # float
a, b = b, a # меняем значение переменных местами, можно менять местами переменные с разнымит типами данных
с = 12 + a  # complex 

bl = False # boolean

print(type(b)) # оперделяе м тип переменной 


# orerations
print(a + b)  # сложение
print(a - b)  # вычитание 
print(a * b)  # умножение
print(a ** b) # возведение в степень
print(a // b) # целочисленное деление (возвращает целую часть результата деления)
print(a % b)  # остаток от деления 

print(round(b, 2)) # округляем до 2 знаков после ,

# snake_case - имена переменных, функций, методов, модулей
# CamleCase - имена классов
# pcg-name - название пакетов
# CONSTANT - кончтанты

null = None

kv = 12

 
